Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/relationships_life_event.html.txt.tmx
Source language: en
Languages: ga

source: Cohabiting couples do not possess the same legal rights and obligations as married couples or civil partnerships in Irish law
ga: Níl na cearta ná na hoibleagáidí dlíthiúla céanna ar lánúineacha comhchónaithe agus atá ar lánúineacha pósta nó páirtnéireachtaí sibhialta i ndlí na hÉireann

source: This has important implications for a number of areas in your life - including inheritance rights, property ownership, custody and guardianship of children, adoption and fostering
ga: Tá impeachtaí tábhachtacha aige seo do roinnt réimsí i do shaol – ina n-áirítear cearta oidhreachtúla, úinéireacht réadmhaoine, cúram agus caomhnóireacht leanaí, uchtú agus altramú

source: There is a redress scheme for cohabiting couples who have been in a long-term cohabiting relationship
ga: Tá scéim chúitimh do lánúineacha comhchónaithe a bhí i gcaidreamh comhchónaithe fadtéarmach

source: CitizensInformation.ie provides information that you need if you are getting married in Ireland and abroad, including information on different legal ways of getting married, how marriage will change your legal status, legal prerequisites for marriage, notification requirements , the registration of marriage and getting married abroad
ga: Soláthraíonn eolasdoshaoranaigh.ie eolas a theastaíonn uait má tá tú ag pósadh in Éirinn agus thar lear, ina áirítear eolas ar bealaí difriúla dlíthiúla le pósadh, an chaoi a n-athróidh pósadh go stádas dlíthiúil, réamhriachtanais dhlíthiúla do phósadh, ceanglais fhógra, clárú pósta agus pósadh thar lear

source: Before 16 November 2015 there was provision for the legal registration of same-sex couples as civil partnerships
ga: Roimh an 16 Samhain 2015, bhí foráil ann chun lánúineacha comhghnéis a chlárú mar pháirtnéireachtaí sibhialta

source: This provision has been repealed for new civil parnerships
ga: Aisghairtear an foráil seo i gcás páirtnéireachtaí nua sibhialta

source: However, it is now possible for same-sex couples to become legally married and to have the same rights and obligations towards each other as opposite-sex married couples.It is also possible for a couple in a civil partnership to marry
ga: Anois, áfach, is féidir le lánúineacha comhghnéis pósadh go dlíthiúil agus na cearta agus na dualgais chéanna a bheith acu i leith a chéile ná mar atá ag lánúineacha nach den ghnéas céanna iad. I gcás lánúin i bpáirtnéireacht shibhialta, is féidir leo fáil pósta freisin

source: CitizensInformation.ie provides information on how civil partnership changes your legal status
ga: Tá tuilleadh eolais ar fáil ar CitizensInformation.ie faoi mar a athraíonn an pháirtnéireacht shibhialta do stádas dlíthiúil

source: The rights of cohabiting same-sex couples are similar to the rights of cohabiting opposite-sex couples
ga: Tá cearta lanúineacha comhghnéis atá ina gcónaí le chéile cosúil leis na cearta atá ag lánúineacha nach den ghnéas céanna iad atá ina gcónaí le chéile

source: Our section on cohabiting couples looks at various aspects of your life with your partner
ga: Is é atá i gceist leis an gcuid den láithreán gréasáin seo a bhaineann le lánúineacha a bhfuil cónaí orthu lena chéile ná eolas ar ghnéithe éagsúla de do shaol le do pháirtí

source: We also examine the issue of surrogate motherhood
ga: Déanaimid cás an mháthreachais ionaid a phlé freisin

source: Separation, divorce and dissolution
ga: Scaradh, colscaradh agus díscaoileadh

source: The end of a marriage or a civil partnership is a difficult and traumatic process
ga: Is próiseas deacair agus trámach atá i gcríoch phósadh nó pháirtnéireacht shibhialta

source: The information provided on the Citizens Information website will help you deal with the different practical aspects of a marriage or civil partnership breakdown
ga: Cabhróigh an t-eolas atá soláthartha ar shuíomh gréasáin Eolas do Shaoránaigh déileáil le gnéithe praiticiúla difriúla de chliseadh pósadh nó páirtnéireacht shibhialta

source: Information is available on the legal options following a marital breakdown and the legal options following a civil partnership breakdown, such as divorce, judicial separation, separation agreements and dissolution
ga: Tá eolas ar fáil ar roghanna dlíthiúla tar éis cliseadh pósadh agus na roghanna dlíthiúla tar éis cliseadh pháirtnéireacht shibhialta, ar nós colscaradh, scaradh breithiúnach, comhaontaithe scartha agus díscaoileadh

source: There is also information on what happens the family or shared home and maintenance agreements
ga: Tá eolas freisin ar a tharlaíonn leis an teach teaghlaigh nó an comhtheach agus comhaontaithe cothabhála

source: Grandparents also have certain rights in relation to their grandchild
ga: Tá cearta ar leith ag seantuismitheoirí freisin maidir le garmhac/gariníon leo

source: Where grandparents are having difficulty in maintaining contact with their grandchild, they can apply for access to the child through the District Court
ga: Áit a bhfuil deacrachtaí ag seantuismitheoirí teagmháil a choinneáil le garmhac/gariníon is féidir leo cur isteach ar rochtain ar an leanbh tríd an gCúirt Dúiche

source: Access can also be applied for if a child is in the care of the HSE
ga: Is féidir cur isteach ar rochtain freisin má tá an leanbh faoi chúram FSS

source: Any relative, including a grandparent, can apply to the court for custody of a child
ga: Is féidir le gaol ar bith, seantuismitheoir san áireamh, iarratas a dhéanamh ar an gcúirt le haghaidh coimeád leanbh

source: The court will not normally make an order for custody without the consent of the child’s guardians
ga: Ní thugann an cúirt ordú coimeádta de ghnáth gan comhthoiliú chaomhnóirí an linbh

source: However, it may dispense with the consent if it is satisfied that it is in the best interest of the child to make the order
ga: Ach is féidir leo an comhthoiliú sin a ligeann thar ceal áfach, má cheaptar go rachadh sé chun leasa an linbh an t-ordú a dhéanamh

source: If the grandparents are the main carers of the child and the child is not being properly maintained financially by either or both parents, the grandparents can apply to the District Court for a maintenance order
ga: Áit a bhfuil na seantuismitheoirí ina bpríomhchúramóirí ar an leanbh agus nach bhfuil cothabháil chuí airgeadais á fáil ó dhuine amháin de na tuismitheoirí nó ón mbeirt acu, is féidir leis na seantuismitheoirí iarratas a dhéanamh ar an gCúirt Dúiche chun ordú cothabhála a fháil

source: A parent can nominate a person (including a grandparent) to act as a guardian if the parent is unable, through serious illness or injury, to exercise their guardianship rights
ga: Is féidir le tuismitheoir duine éigin a ainmniú (seantuismitheoir san áireamh) mar chaomhnóir mura bhfuil an tuismitheoir féin ábalta, de dheasca breoiteachta nó gortaithe thromchúisigh, a bhfreagrachtaí caomhnóireachta a chur i bhfeidhm

source: Where parents die without making a will appointing someone to act as guardian of their child, the grandparents can apply to the District Court to be appointed guardians
ga: Áit a bhfaigheann tuismitheoirí bás gan ann d’uacht ina bhfuil duine éigin ainmnithe chun bheith ina chaomhnóir/caomhnóir ar a leanbh, is féidir leis na seantuismitheoirí iarratas a dhéanamh ar an gCúirt Dúiche chun a bheith ceaptha ina gcaomhnóirí

source: Grandparents can also apply for guardianship:
ga: Is féidir le seantuismitheoirí iarratas a dhéanamh ar chaomhnóireacht sna cásanna seo a leanas:

source: • If they have provided the day-to-day care of the child for a continuous period of 12 months or more and
ga: • Má tá siad tar éis cúram laethúil a thabhairt don leanbh ar feadh tréimhse leanúnaí 12 mhí nó níos mó agus

source: • Where there is no parent or guardian willing or able to exercise guardianship rights and responsibilities in respect of the child
ga: • Áit nach ann do thuismitheoir nó do chaomhnóir a bhfuil toilteanach nó ábalta a gcearta agus a ndualgais caomhnóireachta a chur i bhfeidhm maidir leis an leanbh

source: The court will decide the extent of the guardianship rights the grandparents will have
ga: Déanfaidh an chúirt cinneadh maidir le cé chomh fairsing is a bheith cearta caomhnóireachta na seantuismitheoirí

source: Grandparents may be able to adopt or foster a grandchild
ga: D’fhéadfadh seantuismitheoirí a bheith in ann garmhac/gariníon a uchtú nó a altramú

source: You can find more information on grandparent’s rights on Treoir’s website
ga: Tá tuilleadh eolais le fáil maidir le cearta seantuismitheoirí ar láithreán gréasáin Treoir

source: Treoir have also published a booklet entitled Being there for them (pdf) for grandparents of children whose parents are not married to each other
ga: Tá leabhrán eolais foilsithe ag Treoir freisin dar teideal Being there for them (pdf) le haghaidh seantuismitheoirí leanaí nach bhfuil a dtuismitheoirí pósta
